# Тест только для jobs

# ##############################

echo 'Покажим что jobs нет'
jobs

# Тут все отличаеться ##############################
# Запустим пару процессов и сразу же приостановим их ##############################
ls -Ra 2>&- 1>&-/ &
zz1=$!
kill -s STOP $!
ls -Rb 2>&- 1>&-/ &
zz2=$!
kill -s STOP $!
ls -Rc 2>&- 1>&-/ &
zz3=$!
kill -s STOP $!
ls -Rf 2>&- 1>&-/ &
zz4=$!
kill -s STOP $!

# ##############################
echo 'Pid запущенных процессов'
echo $zz1 $zz2 $zz3 $zz4


# ##############################
echo 'Тестируем: jobs'
jobs


# ##############################
echo 'Тестируем: jobs -l'
jobs -l


# ##############################
echo 'Тестируем: jobs -p'
jobs -p


# ##############################
echo 'Тестируем: jobs -p %%'
jobs -p %%
echo 'Тестируем: jobs -l %%'
jobs -l %%
echo 'Тестируем: jobs -p %+'
jobs -p %+
echo 'Тестируем: jobs -l %+'
jobs -l %+


# ##############################
echo 'Тестируем: jobs -p %-'
jobs -p %-
echo 'Тестируем: jobs -l %-'
jobs -l %-


# ##############################
echo 'Тестируем: jobs -p %1'
jobs -p %1
echo 'Тестируем: jobs -l %1'
jobs -l %1


# ##############################
echo 'Тестируем: jobs -p %ls'
jobs -p %ls
echo 'Тестируем: jobs -l %ls'
jobs -l %ls


# ##############################
echo 'Тестируем: jobs -p %?s'
jobs -p '%?s'
echo 'Тестируем: jobs -l %?s'
jobs -l '%?s'


# ##############################
kill -s TERM $zz4
kill -s TERM $zz2
echo 'Тестируем: реакцию на то что jobs был убит'
jobs 


 # ##############################
echo 'Тестируем: не существующий id'
jobs -p %4


 # ##############################
echo 'Тестируем: не валидные опции'
jobs -p -ваапва %%


 # ##############################
echo 'Тестируем: разницу между -l и -p'
ls -Ra 2>&- / | cat -e 1>&- &
zz2=$!
kill -s STOP $!
ls -Ra 2>&- / | cat -e 1>&- &
zz4=$!
kill -s STOP $!
jobs -l
jobs -p


echo 'Тестируем: работу последней опции'
jobs -lplplplpl

echo 'Тестируем: несколько вариаций'
jobs -l %% -p %%

#  Убьем что бы не мешали навернека ##############################
kill -s TERM $zz1
kill -s TERM $zz2
kill -s TERM $zz3
kill -s TERM $zz4


# ##############################
echo 'Это должно всегда отображаться'